export const helpString = `כדי שאדע שאתם מדברים אלי, תזכירו אותי בהודעה שלכם, תוסיפו את השם שלי
@SuperPony.

הנה רשימת הפקודות שאני יודע לבצע:
1. להציג את כל הטיקרים שבמעקב בחוכמת הסורק – כתבו: טיקרים
   לדוגמה: @SuperPony טיקרים

2. להציג את כל הטיקרים שבמעקב שאתם ציינתם ראשונים החודש – כתבו: טיקרים שלי
   לדוגמה: @SuperPony טיקרים שלי
   או: @SuperPony שלי

3. להציג את כל הטיקרים של חברות שמדווחות היום – כתבו: דיווחים או מדווחות
   לדוגמה: @SuperPony דיווחים
   או: @SuperPony מדווחות

4. להציג תמונה של החברות שהכי מצפים לדיווח שלהן היום – כתבו: תמונת דיווחים או תמונה
   לדוגמה: @SuperPony תמונת דיווחים
   או: @SuperPony תמונה

5. להציג את הטיקרים של חברות ה־סאפ 500 שמדווחות היום – כתבו: דיווחים 500
   לדוגמה: @SuperPony דיווחים 500

יש גם פקודת סלאש:
להציג את כל הדיווחים של היום, עם אפשרות לסנן לפי סוג או מספר תוצאות.
/todays_earnings  (type: All | S&P 500 | Anticipated, limit: #)
`;

export async function sendHelp({ channel }) {
  await channel.send(helpString);
}
